In [1]:
import pandas as pd

1. Importing s&p 500 index data file

In [3]:
sp_500 = pd.read_csv("C:/Users/Admin/Documents/ironhack/ironhack-projects/Data_Thief_Project_Team_Wall-e/data/ARCHIV/01_original_index_data/S&P_500_US")

In [4]:
sp_500.head()

         date    value
0  2007-04-09  1444.61
1  2007-04-10  1448.39
2  2007-04-11  1438.87
3  2007-04-12  1447.80
4  2007-04-13  1452.85

In [5]:
sp_500.columns = ["date", "value_SP_500_US"]

In [6]:
sp_500.head()

         date  value_SP_500_US
0  2007-04-09          1444.61
1  2007-04-10          1448.39
2  2007-04-11          1438.87
3  2007-04-12          1447.80
4  2007-04-13          1452.85

2. Changing date type to date format

In [7]:
sp_500["date"] = pd.to_datetime(sp_500["date"])

In [8]:
sp_500.dtypes

date               datetime64[ns]
value_SP_500_US           float64
dtype: object

3. Getting data starting from 01-01-2019 to newest (07-04-2020)

In [9]:
sp_500 = (sp_500[sp_500["date"] >= "2019-01-01"]
          .reset_index()
          .drop(columns="index"))

In [10]:
sp_500.head()

        date  value_SP_500_US
0 2019-01-02          2510.03
1 2019-01-03          2447.89
2 2019-01-04          2531.94
3 2019-01-07          2549.69
4 2019-01-08          2574.41

In [11]:
sp_500.dtypes

date               datetime64[ns]
value_SP_500_US           float64
dtype: object

4. Changing order starting from newest value (07-04-2020)

In [12]:
sp_500 = sp_500.sort_values("date", ascending=False)

In [13]:
sp_500 = sp_500.reset_index().drop(columns="index")

In [14]:
sp_500 = sp_500.dropna().reset_index().drop(columns="index")

In [15]:
sp_500.head()

        date  value_SP_500_US
0 2020-04-07          2659.41
1 2020-04-06          2663.68
2 2020-04-03          2488.65
3 2020-04-02          2526.90
4 2020-04-01          2470.50

In [16]:
#sp_500.to_csv("C:/Users/Admin/Documents/ironhack/ironhack-projects/Data_Thief_Project_Team_Wall-e/data/S&P_500_US_clean.csv", index=False)